; Процедуры для вывода на индикацию и сообщения
; Просто последовательность команд и кодов символов
;---------------------------------------------------------------------------
;Режим BUT1off
BUT1off:
			CBI PORTB,OUT1
	RET
;---------------------------------------------------------------------------
;Режим BUT1on
BUT1on:
			SBI PORTB,OUT1
	RET
;---------------------------------------------------------------------------
;Режим BUT2off
BUT2off:
			CBI PORTB,OUT2
	RET
;---------------------------------------------------------------------------
;Режим BUT2on
BUT2on:
			SBI PORTB,OUT2
	RET
;---------------------------------------------------------------------------

